/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncmp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: baaegon <baaegon@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/22 12:32:48 by baaegon           #+#    #+#             */
/*   Updated: 2021/10/26 16:02:24 by baaegon          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* сравнивает не более первых n символов двух строк. возвращает 0 если идентичны.
возвращает *s1 - *s2 если встретились различающиеся символы */
#include "libft.h"

int	ft_strncmp(const char *s1, const char *s2, size_t n)
{
	if (!n)
		return (0);
	while (n--)
	{
		if (*s1 != *s2)
			return ((unsigned char)*s1 - (unsigned char)*s2);
		else if (!*s1++ || !*s2++)
			return (0);
	}
	return (0);
}
