/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strrchr.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: baaegon <baaegon@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/21 18:59:50 by baaegon           #+#    #+#             */
/*   Updated: 2021/10/26 16:02:57 by baaegon          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ищет последнее вхождение символа с в строку s. область поиска ограничена strlen+1
(\0 рассматривается как часть строки) */
#include "libft.h"

char	*ft_strrchr(const char *s, int c)
{
	unsigned char	ch;
	size_t			len;

	ch = c;
	len = ft_strlen(s) + 1;
	while (len)
	{
		if (s[--len] == ch)
			return ((char *)s + len);
	}
	return (0);
}
