/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlcpy.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: baaegon <baaegon@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/16 19:08:33 by baaegon           #+#    #+#             */
/*   Updated: 2021/10/26 16:01:46 by baaegon          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* копирует из строки src в буфер dst не более чем size - 1 символов
если size > 0 и запись символов состоится, строка dst будет гарантированно нуль-терминирована.
возвращает длину src */
#include "libft.h"

size_t	ft_strlcpy(char *dst, const char *src, size_t dstsize)
{
	size_t	i;

	i = 0;
	if (dstsize > 0)
	{
		while (src[i] && i < (dstsize - 1))
		{
			dst[i] = src[i];
			i++;
		}
		dst[i] = 0;
	}
	while (src[i])
		i++;
	return (i);
}
