/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: baaegon <baaegon@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/25 12:11:36 by baaegon           #+#    #+#             */
/*   Updated: 2021/10/26 16:00:12 by baaegon          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* применяет функцию f к каждому символу строки s */
#include "libft.h"

void	ft_striteri(char *s, void(*f)(unsigned int, char *))

{
	size_t	i;

	i = 0;
	if (!s || !f)
		return ;
	while (s[i])
	{
		f(i, &s[i]);
		i++;
	}
}
